In [41]:
import pandas as pd

# September Sales Data

In [42]:
df = pd.read_excel('/Users/admin/Downloads/Monatsreport /list_sept_generic.xlsx')
df

,Type,Date,Store,Pos,Number,Line,Article Code,Item,Client,Retailer,...,Mode Generation,Tax Family,Document Number,Discount %,Price unit including VAT,Total discount,Price unit netto including VAT,Mode Creation2,name/surname,Total unit excluding VAT
0,CCK,2025-09-01,DE - Berlin,108108,25004255,1,AA,opening_closing,9000000000001,BER000,...,NaN,NaN,NaN,0,450.0,0.0,450,erstellt,opening_closing,450.00
1,CCK,2025-09-01,DE - Berlin,108108,25004256,1,8000000000002,ITEM 2,9000000000002,BER000,...,NaN,NOR,006 30379,0,29.9,0.0,30,eingegeben,INANIR,25.13
2,CCK,2025-09-01,DE - Berlin,108108,25004257,1,8000000000003,ITEM 3,9000000000003,BER000,...,NaN,NOR,006 30380,0,22.9,0.0,23,eingegeben,ONEILL,19.24
3,CCK,2025-09-01,DE - Berlin,108108,25004258,1,8000000000004,ITEM 4,9000000000004,BER108,...,NaN,NOR,006 30381,0,36.9,0.0,37,eingegeben,THIELE,31.01
4,CCK,2025-09-01,DE - Berlin,108108,25004259,1,8000000000005,ITEM 5,9000000000005,BER108,...,NaN,NOR,006 30382,0,21.9,0.0,22,eingegeben,LIZAMA,18.40
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
983,CCK,2025-09-30,DE - Berlin,108108,25004931,1,8000000000406,ITEM 220,9000000000984,BER612,...,NaN,NOR,006 31000,0,23.9,0.0,24,eingegeben,DALLY,20.08
984,CCK,2025-09-30,DE - Berlin,108108,25004932,1,8000000000329,ITEM 329,9000000000985,BER612,...,NaN,NOR,006 31001,0,26.9,0.0,27,eingegeben,GULO,22.61
985,CCK,2025-09-30,DE - Berlin,108108,25004933,1,8000000000029,ITEM 29,9000000000986,BER612,...,NaN,NOR,006 31002,0,21.9,0.0,22,eingegeben,YUO,55.21
986,CCK,2025-09-30,DE - Berlin,108108,25004934,1,8000000000034,ITEM 34,9000000000986,BER612,...,NaN,NOR,006 31003,0,24.9,0.0,25,eingegeben,YUO,20.92
987,CCK,2025-09-30,DE - Berlin,108108,25004935,1,AA,opening_closing,9000000000001,BER612,...,NaN,NaN,NaN,0,-450.0,0.0,-450,erstellt,opening_closing,-450.00

In [43]:
df.columns

Index(['Type', 'Date', 'Store', 'Pos', 'Number', 'Line', 'Article Code',
       'Item', 'Client', 'Retailer', 'Quantity', 'Amount VAT', 'Mode Creation',
       'Mode Generation', 'Tax Family', 'Document Number', 'Discount %',
       'Price unit including VAT', 'Total discount',
       'Price unit netto including VAT', 'Mode Creation2', 'name/surname',
       'Total unit excluding VAT'],
      dtype='object')

In [44]:
df = df[df['Item'] != 'opening_closing']

In [45]:
df = df.drop(['Type','Date','Store','Pos','Number','Line','Article Code','Client','Retailer','Amount VAT','Mode Creation','Mode Generation','Tax Family','Document Number','Mode Creation2','name/surname','Total unit excluding VAT'], axis=1)
df

,Item,Quantity,Discount %,Price unit including VAT,Total discount,Price unit netto including VAT
1,ITEM 2,1,0,29.9,0.0,30
2,ITEM 3,1,0,22.9,0.0,23
3,ITEM 4,1,0,36.9,0.0,37
4,ITEM 5,1,0,21.9,0.0,22
5,ITEM 6,1,0,21.9,0.0,22
...,...,...,...,...,...,...
982,ITEM 983,1,0,28.9,0.0,29
983,ITEM 220,1,0,23.9,0.0,24
984,ITEM 329,1,0,26.9,0.0,27
985,ITEM 29,3,0,21.9,0.0,22
986,ITEM 34,1,0,24.9,0.0,25

In [46]:
df.info

<bound method DataFrame.info of          Item  Quantity  Discount %  Price unit including VAT  Total discount  \
1      ITEM 2         1           0                      29.9             0.0
2      ITEM 3         1           0                      22.9             0.0
3      ITEM 4         1           0                      36.9             0.0
4      ITEM 5         1           0                      21.9             0.0
5      ITEM 6         1           0                      21.9             0.0
..        ...       ...         ...                       ...             ...
982  ITEM 983         1           0                      28.9             0.0
983  ITEM 220         1           0                      23.9             0.0
984  ITEM 329         1           0                      26.9             0.0
985   ITEM 29         3           0                      21.9             0.0
986   ITEM 34         1           0                      24.9             0.0

     Price unit netto including VAT
1                                30
2                                23
3                                37
4                                22
5                                22
..                              ...
982                              29
983                              24
984                              27
985                              22
986                              25

[934 rows x 6 columns]>

In [47]:
df['Occurrences'] = df.groupby('Item')['Item'].transform('size')
df

,Item,Quantity,Discount %,Price unit including VAT,Total discount,Price unit netto including VAT,Occurrences
1,ITEM 2,1,0,29.9,0.0,30,4
2,ITEM 3,1,0,22.9,0.0,23,4
3,ITEM 4,1,0,36.9,0.0,37,4
4,ITEM 5,1,0,21.9,0.0,22,7
5,ITEM 6,1,0,21.9,0.0,22,7
...,...,...,...,...,...,...,...
982,ITEM 983,1,0,28.9,0.0,29,1
983,ITEM 220,1,0,23.9,0.0,24,8
984,ITEM 329,1,0,26.9,0.0,27,9
985,ITEM 29,3,0,21.9,0.0,22,15
986,ITEM 34,1,0,24.9,0.0,25,4

In [48]:
df['Total Quantity'] = df.groupby('Item')['Quantity'].transform('sum')
df

,Item,Quantity,Discount %,Price unit including VAT,Total discount,Price unit netto including VAT,Occurrences,Total Quantity
1,ITEM 2,1,0,29.9,0.0,30,4,4
2,ITEM 3,1,0,22.9,0.0,23,4,4
3,ITEM 4,1,0,36.9,0.0,37,4,2
4,ITEM 5,1,0,21.9,0.0,22,7,7
5,ITEM 6,1,0,21.9,0.0,22,7,7
...,...,...,...,...,...,...,...,...
982,ITEM 983,1,0,28.9,0.0,29,1,1
983,ITEM 220,1,0,23.9,0.0,24,8,8
984,ITEM 329,1,0,26.9,0.0,27,9,9
985,ITEM 29,3,0,21.9,0.0,22,15,17
986,ITEM 34,1,0,24.9,0.0,25,4,4

# Top 20 Items - Quantity Sold

In [49]:
top_20_items_quantity = (df.groupby('Item')['Quantity'].sum().reset_index().sort_values(by='Quantity', ascending=False).head(20).reset_index(drop=True))
top_20_items_quantity.index = top_20_items_quantity.index + 1
top_20_items_quantity

               Item  Quantity
1   PERSONALIZATION       122
2            ITEM 9        25
3           ITEM 45        18
4           ITEM 29        17
5           ITEM 83        15
6          ITEM 152        12
7           ITEM 30        11
8          ITEM 248        11
9           ITEM 19        10
10         ITEM 403        10
11          ITEM 79        10
12         ITEM 449        10
13          ITEM 22         9
14          ITEM 10         9
15         ITEM 329         9
16         ITEM 162         9
17         ITEM 105         9
18          ITEM 52         9
19         ITEM 197         8
20         ITEM 121         8

# Top 20 Items - Price unit

In [50]:
top_20_items_value = (df.assign(IndividualTotalValue=lambda x: x['Quantity'] * x['Price unit including VAT'])
    .groupby('Item', as_index=False)
    .agg({'Quantity': 'sum', 'IndividualTotalValue': 'sum'})
    .rename(columns={'Quantity': 'Quantity', 'IndividualTotalValue': 'Total Value'})
    .sort_values(by='Total Value', ascending=False)
    .reset_index(drop=True)
    .head(20))

top_20_items_value['Total Value'] = top_20_items_value['Total Value'].apply(lambda x: f'€{x:,.2f}')
top_20_items_value.index = top_20_items_value.index + 1
top_20_items_value

               Item  Quantity Total Value
1          ITEM 376         4     €996.00
2   PERSONALIZATION       122     €610.00
3           ITEM 45        18     €576.00
4          ITEM 142         7     €560.00
5            ITEM 9        25     €547.50
6           ITEM 83        15     €495.00
7           ITEM 36         2     €450.00
8           ITEM 29        17     €372.30
9          ITEM 449        10     €310.00
10         ITEM 248        11     €302.50
11         ITEM 429         2     €290.00
12         ITEM 403        10     €279.00
13         ITEM 219         2     €276.00
14         ITEM 152        12     €262.80
15          ITEM 62         3     €254.70
16          ITEM 22         9     €243.00
17         ITEM 329         9     €242.10
18          ITEM 10         9     €242.10
19         ITEM 208         5     €225.00
20          ITEM 19        10     €219.00

# Top 20 Items - Net Value

In [51]:
top_20_items_value_netto = (df.assign(IndividualTotalValue=lambda x: x['Quantity'] * x['Price unit netto including VAT'])
    .groupby('Item', as_index=False)
    .agg({'Quantity': 'sum', 'IndividualTotalValue': 'sum'})
    .rename(columns={'Quantity': 'Quantity', 'IndividualTotalValue': 'Total Net Value'})
    .sort_values(by='Total Net Value', ascending=False)
    .reset_index(drop=True)
    .head(20))

top_20_items_value_netto['Total Net Value'] = top_20_items_value_netto['Total Net Value'].apply(lambda x: f'€{x:,.2f}')
top_20_items_value_netto.index = top_20_items_value_netto.index + 1
top_20_items_value_netto

               Item  Quantity Total Net Value
1          ITEM 376         4         €721.00
2   PERSONALIZATION       122         €584.00
3           ITEM 45        18         €541.00
4          ITEM 142         7         €536.00
5            ITEM 9        25         €512.00
6           ITEM 83        15         €475.00
7           ITEM 36         2         €428.00
8           ITEM 29        17         €370.00
9          ITEM 449        10         €310.00
10         ITEM 248        11         €301.00
11         ITEM 403        10         €277.00
12         ITEM 429         2         €268.00
13         ITEM 152        12         €262.00
14         ITEM 219         2         €248.00
15          ITEM 10         9         €243.00
16          ITEM 22         9         €243.00
17         ITEM 329         9         €243.00
18         ITEM 208         5         €221.00
19          ITEM 62         3         €221.00
20          ITEM 19        10         €220.00

In [52]:
#top_20_items_quantity.to_csv('top_20_items_quantity.csv', index=False)
#top_20_items_value.to_csv('top_20_items_value.csv', index=False)
#top_20_items_value_netto.to_csv('top_20_items_value_netto.csv', index=False)